<?php 
namespace App\Containers\Payment\Mellat;

trait MellatErrors {

	public function getErrors(){
		return [
			0 => 'تراکنش با موفقيت انجام شد',
			11 => 'شماره کارت نامعتبر است',
			11 => 'تراکنش با موفقيت انجام شد',
			12 => 'موجودی کافي نيست',
			13 => 'رمز نادرست است',
			14 => 'تعداد دفعات وارد کردن رمز بيش از حد مجاز است',
			15 => 'کارت نامعتبر است',
			16 => 'دفعات برداشت وجه بيش از حد مجاز است',
			17 => 'کاربر از انجام تراکنش منصرف شده است',
			18 => 'تاريخ انقضای کارت گذشته است',
			19 => 'مبلغ برداشت وجه بيش از حد مجاز است',
			111 => 'صادر کننده کارت نامعتبر است',
			112 => 'خطای سوييچ صادر کننده کارت',
			113 => 'پاسخي از صادر کننده کارت دريافت نشد',
			114 => 'دارنده کارت مجاز به انجام اين تراکنش نيست',
			21 => 'پذيرنده نامعتبر است',
			23 => 'خطای امنيتي رخ داده است',
			24 => 'اطلاعات کاربری پذيرنده نامعتبر است',
			25 => 'مبلغ نامعتبر است',
			31 => 'پاسخ نامعتبر است',
			32 => 'فرمت اطلاعات وارد شده صحيح نمي باشد',
			33 => 'حساب نامعتبر است',
			34 => 'خطای سيستمي',
			35 => 'تاريخ نامعتبر است',
			41 => 'شماره درخواست تکراری است',
			42 => 'تراکنش Sale يافت نشد',
			43 => 'قبلا درخواست Verify داده شده است',
			44 => 'درخواست Verfiy يافت نشد',
			45 => 'تراکنش Settle شده است',
			46 => 'تراکنش Settle نشده است',
			47 => 'تراکنش Settle يافت نشد',
			48 => 'تراکنش Reverse شده است',
			412 => 'شناسه قبض نادرست است',
			413 => 'شناسه پرداخت نادرست است',
			414 => 'سازمان صادر کننده قبض نامعتبر است',
			415 => 'زمان جلسه کاری به پايان رسيده است',
			416 => 'خطا در ثبت اطلاعات',
			417 => 'شناسه پرداخت کننده نامعتبر است',
			418 => 'اشکال در تعريف اطلاعات مشتری',
			419 => 'تعداد دفعات ورود اطلاعات از حد مجاز گذشته است',
			421 => 'IPنامعتبر است',
			51 => 'تراکنش تکراری است',
			54 => 'تراکنش مرجع موجود نيست',
			55 => 'تراکنش نامعتبر است',
			61 => 'خطا در واريز'
		];

	}

}